Table of Contents
 Class ConnectionSetup
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
ConnectionSetup
public class ConnectionSetup
Inheritance
object
ConnectionSetup
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ConnectionSetup()
Constructor
public ConnectionSetup()
Properties
 AlphaCC
Long-term effect on fcd
public double AlphaCC { get; set; }
Property Value
double
 AnalysisAllGNL
Analysis with All GNL
public bool AnalysisAllGNL { get; set; }
Property Value
bool
 AnalysisGNL
Analysis with GNL
public bool AnalysisGNL { get; set; }
Property Value
bool
 AnchorLengthForStiffness
Length of anchor to define the anchor stiffness in analysis model, as a multiple of anchor diameter (E A /n * [d])
public int AnchorLengthForStiffness { get; set; }
Property Value
int
 ApplyBearingCheck
ApplyBearingCheck
public bool ApplyBearingCheck { get; set; }
Property Value
bool
 ApplyBetapInfluence
Apply βp influence in bolt shear resistance. ΕΝ 1993-1-8 chapter 3.6.1 (12)
public bool ApplyBetapInfluence { get; set; }
Property Value
bool
 ApplyConeBreakoutCheck
Apply cone breakout check
public ConeBreakoutCheckType ApplyConeBreakoutCheck { get; set; }
Property Value
ConeBreakoutCheckType
 BaseMetalCapacity
BaseMetalCapacity
public bool BaseMetalCapacity { get; set; }
Property Value
bool
 BearingAngle
Load distribution angle of concrete block in calculation of factor Kj
public double BearingAngle { get; set; }
Property Value
double
 BearingCheck
Apply bearing check including αb
public bool BearingCheck { get; set; }
Property Value
bool
 BoltMaxGripLengthCoeff
Max value of bolt grip
public double BoltMaxGripLengthCoeff { get; set; }
Property Value
double
 BracedSystem
Consider the frame system as braced for stiffness calculation. Braced system reduces horizontal displacements.
public bool BracedSystem { get; set; }
Property Value
bool
 CheckDetailing
Perform check of bolt positions
public bool CheckDetailing { get; set; }
Property Value
bool
 ConcreteSetup
Concrete setup
[Obsolete]
public ConcreteSetup ConcreteSetup { get; set; }
Property Value
ConcreteSetup
 CondensedElementLengthFactor
Condensed element length factor (CEF). Condensed beam legth = maxCssSize * CEF
public double CondensedElementLengthFactor { get; set; }
Property Value
double
 CrackedConcrete
True if cracked concrete is considered
public bool CrackedConcrete { get; set; }
Property Value
bool
 CrtCompCheckIS
Crt check type
public CrtCompCheckIS CrtCompCheckIS { get; set; }
Property Value
CrtCompCheckIS
 DecreasingFtrd
Decreasing Ftrd of anchors. Worse quality influence
public double DecreasingFtrd { get; set; }
Property Value
double
 DeformationBoltHole
True if bolt hole deformation is considered
public bool DeformationBoltHole { get; set; }
Property Value
bool
 DevelopedFillers
True if developed fillers is considered
public bool DevelopedFillers { get; set; }
Property Value
bool
 DistanceBetweenBolts
Limit distance between bolts as a multiple of bolt diameter
public double DistanceBetweenBolts { get; set; }
Property Value
double
 DistanceBetweenBoltsEdge
Limit distance between bolt and plate edge as a multiple of bolt diameter
public double DistanceBetweenBoltsEdge { get; set; }
Property Value
double
 DistanceDiameterBetweenBP
Anchor pitch
public double DistanceDiameterBetweenBP { get; set; }
Property Value
double
 DivisionOfArcsOfRHS
Number of straight lines to substitute corner arc of rectangular tubes in analysis model
public int DivisionOfArcsOfRHS { get; set; }
Property Value
int
 DivisionOfSurfaceOfCHS
Number of straight lines to substitute circle of circular tube in analysis model
public int DivisionOfSurfaceOfCHS { get; set; }
Property Value
int
 EffectiveAreaStressCoeff
Effective area is taken from intersection of stress area and area of joined items according to EN1993-1-8 art. 6.2.5
public double EffectiveAreaStressCoeff { get; set; }
Property Value
double
 EffectiveAreaStressCoeffAISC
Effective area stress coefficient - Concrete loaded area: Stress cut-off is set for AISC
public double EffectiveAreaStressCoeffAISC { get; set; }
Property Value
double
 ExtensionLengthRationCloseSections
ExtensionLengthRationCloseSections
public double ExtensionLengthRationCloseSections { get; set; }
Property Value
double
 ExtensionLengthRationOpenSections
ExtensionLengthRationOpenSections
public double ExtensionLengthRationOpenSections { get; set; }
Property Value
double
 FactorPreloadBolt
FactorPreloadBolt
public double FactorPreloadBolt { get; set; }
Property Value
double
 FatigueSectionOffset
Fatigue section Offset = FatigueSectionOffset x Legsize
public double FatigueSectionOffset { get; set; }
Property Value
double
 FrictionCoefficient
Coefficient of friction between base plate and concrete block
public double FrictionCoefficient { get; set; }
Property Value
double
 FrictionCoefficientPbolt
Friction factor of slip-resistant joint
public double FrictionCoefficientPbolt { get; set; }
Property Value
double
 GammaC
Partial safety factor of concrete
public double GammaC { get; set; }
Property Value
double
 GammaInst
Partial safety factor of instalation safety
public double GammaInst { get; set; }
Property Value
double
 GammaM3
Preloaded bolts safety factor
public double GammaM3 { get; set; }
Property Value
double
 GammaMu
Partial safety factor for Horizontal tying
public double GammaMu { get; set; }
Property Value
double
 JointBetaFactor
Joint coefficient βj - Used for Fjd calculation
public double JointBetaFactor { get; set; }
Property Value
double
 LimitDeformation
Limit deformation on closed sections
public double LimitDeformation { get; set; }
Property Value
double
 LimitDeformationCheck
Limit deformation on closed sections check or not
public bool LimitDeformationCheck { get; set; }
Property Value
bool
 LimitPlasticStrain
Limit of plastic strain used in 2D plate element check
public double LimitPlasticStrain { get; set; }
Property Value
double
 MaxSize
Maximal size of generated finite mesh element
public double MaxSize { get; set; }
Property Value
double
 Mdiv
Number of iteration steps to evaluate analysis divergence
public int Mdiv { get; set; }
Property Value
int
 MemberLengthRatio
A multiple of cross-section height to determine the default length of member
public double MemberLengthRatio { get; set; }
Property Value
double
 MinSize
Minimal size of generated finite mesh element
public double MinSize { get; set; }
Property Value
double
 NumElement
Ratio of length of decisive plate edge and Elements on edge count determines the average size of mesh element
public int NumElement { get; set; }
Property Value
int
 NumElementPlate
Number of mesh elements on plates
public int NumElementPlate { get; set; }
Property Value
int
 NumElementRhs
Number of mesh elements in RHS height
public int NumElementRhs { get; set; }
Property Value
int
 NumberIterations
More iterations helps to find better solutions in contact elements but increases calculation time
public int NumberIterations { get; set; }
Property Value
int
 OptimalCheckLevel
Optimal check level
public double OptimalCheckLevel { get; set; }
Property Value
double
 PretensionForceFpc
Pretension force fpc = k * fub * As
public double PretensionForceFpc { get; set; }
Property Value
double
 RigidBP
True if rigid base plate is considered
public bool RigidBP { get; set; }
Property Value
bool
 SteelSetup
Steel Setup
public SteelSetup SteelSetup { get; set; }
Property Value
SteelSetup
 StopAtLimitStrain
Stop analysis when the limit strain is reached.
public bool StopAtLimitStrain { get; set; }
Property Value
bool
 WarnCheckLevel
Warning check level
public double WarnCheckLevel { get; set; }
Property Value
double
 WarnPlasticStrain
Warning plastic strain
public double WarnPlasticStrain { get; set; }
Property Value
double
 WeldEvaluationData
Method of evaluation of stress in welds
public WeldEvaluation WeldEvaluationData { get; set; }
Property Value
WeldEvaluation
Methods
 InitByCode()
Inicialize by setted code
public void InitByCode()
 Edit this page